src/templates/get-workers-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bsvc="urn:com.workday/bsvc">
  <soapenv:Header>
    <bsvc:Workday_Common_Header>
      <bsvc:Include_Reference_Descriptors_In_Response>true</bsvc:Include_Reference_Descriptors_In_Response>
    </bsvc:Workday_Common_Header>
  </soapenv:Header>
  <soapenv:Body>
    <bsvc:Get_Workers_Request>
      <bsvc:Request_References bsvc:Skip_Non_Existing_Instances="false" bsvc:Ignore_Invalid_References="false">
        <bsvc:Worker_Reference>
          <bsvc:ID bsvc:type="Employee_ID">{{employeeId}}</bsvc:ID>
        </bsvc:Worker_Reference>
      </bsvc:Request_References>
      <bsvc:Response_Group>
        <bsvc:Include_Reference>true</bsvc:Include_Reference>
        <bsvc:Include_Personal_Information>false</bsvc:Include_Personal_Information>
        <bsvc:Include_Additional_Jobs>false</bsvc:Include_Additional_Jobs>
        <bsvc:Include_Employment_Information>false</bsvc:Include_Employment_Information>
        <bsvc:Include_Compensation>false</bsvc:Include_Compensation>
        <bsvc:Include_Organizations>false</bsvc:Include_Organizations>
        <bsvc:Include_Roles>false</bsvc:Include_Roles>
        <bsvc:Include_Management_Chain_Data>false</bsvc:Include_Management_Chain_Data>
        <bsvc:Include_Benefit_Enrollments>false</bsvc:Include_Benefit_Enrollments>
        <bsvc:Include_Benefit_Eligibility>false</bsvc:Include_Benefit_Eligibility>
        <bsvc:Include_Related_Persons>false</bsvc:Include_Related_Persons>
        <bsvc:Include_Qualifications>false</bsvc:Include_Qualifications>
        <bsvc:Include_Employee_Review>false</bsvc:Include_Employee_Review>
        <bsvc:Include_Goals>false</bsvc:Include_Goals>
        <bsvc:Include_Development_Items>false</bsvc:Include_Development_Items>
        <bsvc:Include_Skills>false</bsvc:Include_Skills>
        <bsvc:Include_Photo>false</bsvc:Include_Photo>
        <bsvc:Include_Worker_Documents>false</bsvc:Include_Worker_Documents>
        <bsvc:Include_Transaction_Log_Data>false</bsvc:Include_Transaction_Log_Data>
        <bsvc:Include_Succession_Profile>false</bsvc:Include_Succession_Profile>
        <bsvc:Include_Talent_Assessment>false</bsvc:Include_Talent_Assessment>
        <bsvc:Include_Employee_Contract_Data>false</bsvc:Include_Employee_Contract_Data>
        <bsvc:Include_Feedback_Received>false</bsvc:Include_Feedback_Received>
        <bsvc:Include_User_Account>false</bsvc:Include_User_Account>
        <bsvc:Include_Career>false</bsvc:Include_Career>
        <bsvc:Include_Account_Provisioning>false</bsvc:Include_Account_Provisioning>
        <bsvc:Include_Background_Check_Data>false</bsvc:Include_Background_Check_Data>
      </bsvc:Response_Group>
    </bsvc:Get_Workers_Request>
  </soapenv:Body>
</soapenv:Envelope>